<template>
  <div>
    <h1>Фильтры и Миксины</h1>
    <h1>Создание простых фильтров</h1>
    <h2>{{title}}</h2>
  </div>
</template>

<script>
// Задание
// Сделать первый фильтр локально lowercase, который приводит к нижнему регистру
// скопировать заголовок и ниже применить к нему фильтр
// Сделать второй фильтр глобально uppercase, который приводит к верхнему регистру
// скопировать заголовок и ниже применить к нему фильтр
// скопировать заголовок и ниже применить к нему оба фильтра

export default {
  data() {
    return {
      title: 'Hello I am Vue!'
    }
  }
}
</script>

<style scoped>

</style>
