import React from 'react';

export const AppAnswer = () => {

    // const str: any = "строка";
    // str / 2 - NaN, такое деление является ошибкой
    // str + 1 - строка1 конкатенация
    // 1 / 0 - Infinity
    // NaN + 1 - NaN Любая математическая операция с NaN возвращает NaN
    // -1 / Infinity - -0
    // 9007199254740992 + 1 - будет также 9007199254740992, так как JavaScript тип number не может безопасно работать с числами,
    // большими, чем 2 в степени 53 - 1 или меньшими отрицательными, может быть ошибка точности

    return (
        <div>

        </div>
    );
};